CSI API ETABS v1

# eCNameType Enumeration

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public enum eCNameType

    Public Enumeration eCNameType

    Dim instance As eCNameType

    public enum class eCNameType

    type eCNameType

Members

| Member name| Value| Description
---|---|---|---
| LoadCase| 0|
| LoadCombo| 1|

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com